app/controllers/brands_controller.rb

  def index
    @brands = Brand.all
---
SELECT "brands".* FROM "brands"